app/views/users/show.html.erb

          <li> <%=link_to "#{city.name}", city_path(city) %>:
          <% if city.posts.where(user_id: @user.id).count == 1 %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 12]]