app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
---
  <div class="row">
    <h3><%=  @post.user.first_name %> <%= @post.user.last_name %> </p>