app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "1"], ["last_name", "1"], ["email", "1"], ["created_at", "2016-08-18 21:13:26.630469"], ["updated_at", "2016-08-18 21:13:26.630469"]]
---
  def create

        @user = User.new(user_params)

        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 12]]
---
  def show
    @user = User.find_by_id(params[:id])
    if @user.id == current_user.id
      @posts = Post.where(user_id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
---
  def edit
    @user = User.find_by_id(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "2222x"], ["updated_at", "2016-08-18 21:48:27.082995"], ["id", 7]]
---
  def update
    @user = User.find_by_id(params[:id])
    if @user.update(user_params)